README.org
#+AUTHOR: Andrej Golovskis
#+auto_tangle: t
#+STARTUP: show2levels

My dotfiles and a new machine setup scripts, using literate programming in org.

* Table of Contents :toc:
- [[#system][System]]
  - [[#init][Init]]
  - [[#system-1][System]]
  - [[#programs][Programs]]
  - [[#shell][Shell]]
  - [[#jetbrains][Jetbrains]]
  - [[#browser][Browser]]
- [[#emacs][Emacs]]
  - [[#init-1][Init]]
  - [[#packages][Packages]]
  - [[#config][Config]]
- [[#still-missing][Still missing]]

* System
Installation of core system packages

- Use ~:tangle~ to remove from adding into a file
- Use no ~:dir /sudo::~ to ask for sudo password
- Use ~:results~ output silent to print to new buffer

** Init
Initializing everything that is needed to start emacs 
*** Upgrade
Run first update and upgrade of a system

#+begin_src shell :results output silent :cache no :tangle scripts/init.sh :mkdirp yes :dir /sudo::

sudo apt -y update
sudo apt -y upgrade

#+end_src

*** Essentials

#+begin_src shell :results output silent :cache no :tangle scripts/init.sh :mkdirp yes :dir /sudo::

sudo apt -y install git
sudo apt -y install curl
sudo apt -y install wget
sudo apt -y install libfuse2
sudo apt -y install stow

#+end_src

*** Emacs

Install doom emacs

#+begin_src shell :results output silent :cache no :tangle scripts/init.sh :mkdirp yes :dir /sudo::

sudo apt remove -y --autoremove emacs emacs-common

sudo apt install -y emacs-gtk
sudo apt install -y ripgrep fd-find

rm -rf /home/"$USER"/.emacs.d/
git clone https://github.com/hlissner/doom-emacs ~/.emacs.d

echo "export PATH=$PATH:$HOME/.emacs.d/bin" >> ~/.bash_profile
source ~/.bash_profile

doom install
doom doctor

#+end_src

*** Stow for dotfiles
#+begin_src shell :results output silent :cache no :tangle scripts/init.sh :mkdirp yes :dir /sudo::
rm -rf ~/.doom.d
stow .

doom sync

#+end_src
** System
*** Build tools
#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

sudo apt install -y build-essential \
                    cmake \
                    libtool
                    libvterm-dev

#+end_src
*** Utilities
#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

sudo apt install -y btop \
                    fastfetch

#+end_src

*** Flatpak
#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

sudo apt install flatpak

# For KDE
sudo apt install plasma-discover-backend-flatpak

# Flatpak repo
flatpak remote-add --if-not-exists flathub https://dl.flathub.org/repo/flathub.flatpakrepo

#+end_src
*** Docker
#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

for pkg in docker.io docker-doc docker-compose podman-docker containerd runc; do sudo apt-get remove $pkg; done

# Add Docker's official GPG key:
sudo apt-get update
sudo apt-get install ca-certificates curl
sudo install -m 0755 -d /etc/apt/keyrings
sudo curl -fsSL https://download.docker.com/linux/debian/gpg -o /etc/apt/keyrings/docker.asc
sudo chmod a+r /etc/apt/keyrings/docker.asc

# Add the repository to Apt sources:
echo \
  "deb [arch=$(dpkg --print-architecture) signed-by=/etc/apt/keyrings/docker.asc] https://download.docker.com/linux/debian \
  $(. /etc/os-release && echo "$VERSION_CODENAME") stable" | \
  sudo tee /etc/apt/sources.list.d/docker.list > /dev/null

sudo apt-get update
sudo apt-get install docker-ce docker-ce-cli containerd.io docker-buildx-plugin docker-compose-plugin

sudo usermod -aG docker $USER
newgrp docker

docker run hello-world

#+end_src

*** KVM / qemu

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

sudo apt install -y qemu-kvm libvirt-daemon-system libvirt-clients bridge-utils virt-manager qemu-guest-agent
sudo adduser $USER libvirt
sudo adduser $USER kvm

sudo systemctl start libvirtd
sudo systemctl enable libvirtd

#+end_src

*** Ansible

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

sudo apt-get install -y software-properties-common
sudo apt-get install -y ansible

#+end_src

** Programs
*** KeePassXC
#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

# KeepassXC
flatpak install -y --system flathub org.keepassxc.KeePassXC

#+end_src

*** Spotify

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

# Spotify
flatpak install -y --system flathub com.spotify.Client
#+end_src
*** VeraCrypt

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

# VeraCrypt
sudo add-apt-repository -y ppa:unit193/encryption
sudo apt-get install -y veracrypt

#+end_src

*** pCloud
- Download from: https://www.pcloud.com/how-to-install-pcloud-drive-linux.html?download=electron-64
- Start ./pcloud
*** Creality Studio
- Download from https://github.com/CrealityOfficial/CrealityPrint/releases latest 
** Shell

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

echo 'deb http://download.opensuse.org/repositories/shells:/fish:/release:/4/Debian_13/ /' | sudo tee /etc/apt/sources.list.d/shells:fish:release:4.list
curl -fsSL https://download.opensuse.org/repositories/shells:fish:release:4/Debian_13/Release.key | gpg --dearmor | sudo tee /etc/apt/trusted.gpg.d/shells_fish_release_4.gpg > /dev/null
sudo apt update
sudo apt install -y fish

#+end_src
** Jetbrains

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

set -e

# Download JetBrains Toolbox
wget -cO /tmp/jetbrains-toolbox.tar.gz "https://data.services.jetbrains.com/products/download?platform=linux&code=TBA"

# Extract archive to /opt
tar -xzf /tmp/jetbrains-toolbox.tar.gz -C /opt

# Find extracted folder (e.g. /opt/jetbrains-toolbox-3.0.1.59888)
DIR="$(ls -d /opt/jetbrains-toolbox-* | sort -V | tail -n 1)"

# Run JetBrains Toolbox
"$DIR/bin/jetbrains-toolbox" &

# Cleanup archive
rm -f /tmp/jetbrains-toolbox.tar.gz

echo "JetBrains Toolbox installed in $DIR"
#+end_src

** Browser
*** Vivaldi

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::

set -e

# Extract the download URL from the Vivaldi download page
DOWNLOADURL="https://vivaldi.com/download/vivaldi-stable_amd64.deb"
INSTALLER=$(mktemp --suffix=.vivaldi.deb)

echo "Downloading Vivaldi from $DOWNLOADURL"

# Download the package to the temporary file
curl -L "$DOWNLOADURL" -o "$INSTALLER"

# Install the package
sudo dpkg -i "$INSTALLER"

# Remove the temporary file
rm "$INSTALLER"

echo "Vivaldi installation complete."

#+end_src

*** Brave

#+begin_src shell :results output silent :cache no :tangle no :dir /sudo::


echo "deb [signed-by=/usr/share/keyrings/brave-browser-archive-keyring.gpg arch=amd64] https://brave-browser-apt-release.s3.brave.com/ stable main"|sudo tee /etc/apt/sources.list.d/brave-browser-release.list


#+end_src
* Emacs
** Init
#+BEGIN_SRC emacs-lisp :tangle .doom.d/init.el :mkdirp yes

;;; init.el -*- lexical-binding: t; -*  -

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find information about all of Doom's
;;      modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c g k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c g d') on a module to browse its
;;      directory (for easy access to its source code).

;; (add-to-list 'exec-path "C:\Users\Andrej\.doom.d\sqlite")

(doom! :input
       ;;chinese
       ;;japanese
       russian

       :completion
       company           ; the ultimate code completion backend
       helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       ivy               ; a search engine for love and life

       :ui
       deft              ; notational velocity for Emacs
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       doom-quit         ; DOOM quit-message prompts when you quit Emacs
       ;;fill-column       ; a `fill-column' indicator
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       ;;hydra
       ;;indent-guides     ; highlighted indent columns
       modeline          ; snazzy, Atom-inspired modeline, plus API
       ;;nav-flash         ; blink cursor line after big motions
       neotree           ; a project drawer, like NERDTree for vim
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       pretty-code       ; ligatures or substitute text with pretty symbols
       tabs              ; an tab bar for Emacs
       treemacs          ; a project drawer, like neotree but cooler
       unicode           ; extended unicode support for various languages
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       indow-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       ;;zen               ; distraction-free coding or writing

       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       ;;(format +onsave)  ; automated prettiness
       ;;god               ; run Emacs commands without modifier keys
       ;;lispy             ; vim for lisp, for people who don't like vim
       ;;multiple-cursors  ; editing in many places at once
       ;;objed             ; text object editing for the innocent
       ;;parinfer          ; turn lisp into python, sort of
       ;;rotate-text       ; cycle region at point between text candidates
       snippets          ; my elves. They type so I don't have to
       ;;word-wrap         ; soft wrapping with language-aware indent

       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ;;ibuffer         ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree

       :term
       eshell            ; the elisp shell that works everywhere
       ;;shell             ; simple shell REPL for Emacs
       ;;term              ; basic terminal emulator for Emacs
       vterm             ; the best terminal emulation in Emacs

       :checkers
       syntax              ; tasing you for every semicolon you forget
       ;;spell             ; tasing you for misspelling mispelling
       ;;grammar           ; tasing grammar mistake every you make

       :tools
       ansible
       ;;debugger          ; FIXME stepping through code, to help you add bugs
       ;;direnv
       docker
       ;;editorconfig      ; let someone else argue about tabs vs spaces
       ;;ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       gist              ; interacting with github gists
       lookup              ; navigate your code and its documentation
       ;;lsp
       ;;macos             ; MacOS-specific commands
       magit             ; a git porcelain for Emacs
       ;;make              ; run make tasks from Emacs
       ;;pass              ; password manager for nerds
       pdf               ; pdf enhancements
       ;;prodigy           ; FIXME managing external services & code builders
       ;;rgb               ; creating color strings
       ;;terraform         ; infrastructure as code
       ;;tmux              ; an API for interacting with tmux
       ;;upload            ; map local to remote projects via ssh/ftp

       :lang
       ;;agda              ; types of types of types of types...
       ;;cc                ; C/C++/Obj-C madness
       ;;clojure           ; java with a lisp
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
       ;;coq               ; proofs-as-programs
       ;;crystal           ; ruby at the speed of c
       ;;csharp            ; unity, .NET, and mono shenanigans
       ;;data              ; config/data formats
       ;;(dart +flutter)   ; paint ui and not much else
       ;;elixir            ; erlang done right
       ;;elm               ; care for a cup of TEA?
       emacs-lisp        ; drown in parentheses
       ;;erlang            ; an elegant language for a more civilized age
       ;;ess               ; emacs speaks statistics
       ;;faust             ; dsp, but you get to keep your soul
       ;;fsharp           ; ML stands for Microsoft's Language
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
       ;;(go +lsp)         ; the hipster dialect
       ;;(haskell +dante)  ; a language that's lazier than I am
       ;;hy                ; readability of scheme w/ speed of python
       ;;idris             ;
       json              ; At least it ain't XML
       ;;(java +meghanada) ; the poster child for carpal tunnel syndrome
       ;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
       ;;julia             ; a better, faster MATLAB
       ;;kotlin            ; a better, slicker Java(Script)
       ;;latex             ; writing papers in Emacs has never been so fun
       ;;lean
       ;;factor
       ;;ledger            ; an accounting system in Emacs
       ;;lua               ; one-based indices? one-based indices
       ;; markdown          ; writing docs for people to ignore
       ;;nim               ; python + lisp at the speed of c
       ;;nix               ; I hereby declare "nix geht mehr!"
       ;;ocaml             ; an objective camel
       org
       ;;(org +roam)         ; organize your plain life in plain text
       ;;perl              ; write code no one else can comprehend
       ;;php               ; perl's insecure younger brother
       ;;plantuml          ; diagrams for confusing people more
       ;;purescript        ; javascript, but functional
       ;;python            ; beautiful is better than ugly
       ;;qt                ; the 'cutest' gui framework ever
       ;;racket            ; a DSL for DSLs
       rest              ; Emacs as a REST client
       ;;rst               ; ReST in peace
       ;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       ;;rust              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       ;;scala             ; java, but good
       ;;scheme            ; a fully conniving family of lisps
       ;; sh                ; she sells {ba,z,fi}sh shells on the C xor
       ;;sml
       ;;solidity          ; do you need a blockchain? No.
       ;;swift             ; who asked for emoji variables?
       ;;terra             ; Earth and Moon in alignment for performance.
       ;;web               ; the tubes
       yaml              ; JSON, but readable

       :email
       ;;(mu4e +gmail)
       ;;notmuch
       ;;(wanderlust +gmail)

       :app
       ;;calendar
       ;;irc               ; how neckbeards socialize
       ;;(rss +org)        ; emacs as an RSS reader
       ;;twitter           ; twitter client https://twitter.com/vnought

       :config
       ;;literate
       (default +bindings +smartparens))

#+END_SRC
** Packages
#+BEGIN_SRC emacs-lisp :tangle .doom.d/packages.el :mkdirp yes

 ;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here, run 'doom sync' on
;; the command line, then restart Emacs for the changes to take effect.
;; Alternatively, use M-x doom/reload.


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a particular repo, you'll need to specify
;; a `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, for whatever reason,
;; you can do so here with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))
(package! org-super-agenda)
(package! org-fancy-priorities)
(package! denote)
(package! org-download)
(package! org-auto-tangle)
(package! pdf-tools)
(package! nerd-icons)
(package! xterm-color)

#+END_SRC

** Config
#+BEGIN_SRC emacs-lisp :tangle .doom.d/config.el :mkdirp yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.


(setq user-full-name "Andrej Golovskis"
      user-mail-address "andrej@golovskis.de")


;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:

(setq doom-font (font-spec :family "Fira Code" :size 36))
(setq doom-theme 'doom-vibrant)

(setq display-line-numbers-type t)
(display-time-mode 1)
(setq display-time-day-and-date t)

;; Start maximalized
(add-hook 'window-setup-hook 'toggle-frame-maximized t)


;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
;; (setq org-directory "~/Shared/pcloud/bestiary/")
;; (setq org-directory "P:/_en1/journal/")
;; (setq org-directory "~/Shared/pcloud/_en1/journal/")
;; (setq org-roam-directory "P:/_en1/bestiary/")
;; (setq org-directory "~/Shared/pcloud/_en1/journal/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.


(setq org-directory "~/org/")
(setq denote-directory "~/_9ILLI,uK")

;; Auto tangle
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))


;; Pdf tools config
(use-package pdf-tools
  :defer t
  :commands (pdf-loader-install)
  :mode "\\.pdf\\'"
  :init (pdf-loader-install)
  :config (add-to-list 'revert-without-query ".pdf"))

(add-hook 'pdf-view-mode-hook #' (lambda () (interactive) (display-line-numbers-mode -1)))


;; Display colors
(defun ek/babel-ansi ()
  (when-let ((beg (org-babel-where-is-src-block-result nil nil)))
    (save-excursion
      (goto-char beg)
      (when (looking-at org-babel-result-regexp)
        (let ((end (org-babel-result-end))
              (ansi-color-context-region nil))
          (ansi-color-apply-on-region beg end))))))
(add-hook 'org-babel-after-execute-hook 'ek/babel-ansi)

#+END_SRC

* Still missing
+ Always start in fullscreen mode -> should be in qtile
+ Add ssh key
+ Add keyboard support for languages
+ Install alacratty
+ Add lockscreen
+ Add qtile
+ Add keepass settings support
+ mu4e support
+ magit
+ add support for shortcuts
+ Browser -> sane configs 
+ Libreoffice
+ Calculator
+ Create manual ? / cheatsheets
+ Screen capture
+ Switch wallpapers 
+ Fix freezing at beginning
+ devtoys
+ Reconfigure doom emacs
+ -> start in a server
